[V11.0]
1 = <a>最新のソフトウェアヘルス</a>アクセス許可の管理に役に立つ、ポップアップ通知をブロック、不要なセットアップファイルを削除、マルウェアとブラウザ拡張機能を削除する
2=<a>より強力なアンインストールエンジン</a> 高度なスキャンスキャンとクリーニングアルゴリズムを使って、残存ファイルをより完全に削除する
3=<a>より徹底的にモニターをインストール</a>将来完全にアンインストールできるために、より多くのインストール中に作成された項目（起動項目を含む）を記録する
4=<a>データベースを50%拡大</a>より多くの人気ソフトの更新をサポート、AnyDesk、Calibre、Discord、LibreOffice、qBittorrentなど
5=<a>独特な頑固プログラムリムーバーデータベース</a> 1000+頑固なプログラムの削除をサポートする
6=<a>強化されたアンインストール+</a>アンインストールレジストリがない場合、プログラムを簡単にアンインストールできる
7=<a> Windowsアプリの評価を追加</a>不要なWindowsアプリの削除に関する情報をユーザーに提供する
8=<a>削除プロセスを改善</a> ブラウザ拡張機能
9=<a>より良いUI </a>より良いユーザー体験のために
10=<a> 2つのスキン：</a>暗いと明るい
11=<a>サポートされている37言語</a>
12=<a>Windows 11 を完全にサポート</a>